aegonar/EMP/CC3200/nfc_reader/pinmux.c
//*****************************************************************************
// pinmux.c 
// 
// Configure the device pins for different peripheral signals
// 
// Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/ 
// 
// 
//  Redistribution and use in source and binary forms, with or without 
//  are met:
//
//    Redistributions of source code must retain the above copyright 
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the 
//    documentation and/or other materials provided with the   
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

//*****************************************************************************
// This file was automatically generated by the CC31xx PinMux Utility
// Version: 1.0.2
//
//*****************************************************************************

#include "pinmux.h"
#include "hw_types.h"
#include "hw_memmap.h"
#include "hw_gpio.h"
#include "pin.h"
#include "rom.h"
#include "rom_map.h"
#include "gpio.h"
#include "prcm.h"

//*****************************************************************************
void
PinMuxConfig(void)
{
    //
    // Enable Peripheral Clocks 
    //
    MAP_PRCMPeripheralClkEnable(PRCM_TIMERA2, PRCM_RUN_MODE_CLK);


    PRCMPeripheralClkEnable(PRCM_GPIOA0, PRCM_RUN_MODE_CLK);
    PRCMPeripheralClkEnable(PRCM_GPIOA1, PRCM_RUN_MODE_CLK);
	PRCMPeripheralClkEnable(PRCM_GPIOA2, PRCM_RUN_MODE_CLK);
	PRCMPeripheralClkEnable(PRCM_GPIOA3, PRCM_RUN_MODE_CLK);

	//
	// Enable Peripheral Clocks
	//
	MAP_PRCMPeripheralClkEnable(PRCM_UARTA0, PRCM_RUN_MODE_CLK);
	MAP_PRCMPeripheralClkEnable(PRCM_UARTA1, PRCM_RUN_MODE_CLK);

	//
	// Configure PIN_55 for UART0 UART0_TX and PIN_01 for UART1 UART1_TX
	//
	MAP_PinTypeUART(PIN_55, PIN_MODE_3);
	MAP_PinTypeUART(PIN_01, PIN_MODE_7);
	//
	// Configure PIN_57 for UART0 UART0_RX and PIN_02 for UART1 UART1_RX
	//
	MAP_PinTypeUART(PIN_57, PIN_MODE_3);
	MAP_PinTypeUART(PIN_02, PIN_MODE_7);
/*

	//
    // Configure PIN_05 for SPI0 GSPI_CLK
    //
	PinTypeSPI(PIN_05, PIN_MODE_7);

	//
    // Configure PIN_06 for SPI0 GSPI_MISO
    //
	PinTypeSPI(PIN_06, PIN_MODE_7);

	//
    // Configure PIN_07 for SPI0 GSPI_MOSI
    //
	PinTypeSPI(PIN_07, PIN_MODE_7);

	//
    // Configure PIN_62 for GPIO IRQ Input
    //
	PinTypeGPIO(PIN_62, PIN_MODE_0, false);
	GPIODirModeSet(GPIOA0_BASE, 0x80, GPIO_DIR_MODE_IN);

	//
    // Configure PIN_01 for Slave Select Output (GPIO10, LED D6)
    //
	PinTypeGPIO(PIN_01, PIN_MODE_0, false);
	GPIODirModeSet(GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT);

	//
    // Configure PIN_02 for TRF enable Output (GPIO11, LED D5)
    //
	PinTypeGPIO(PIN_02, PIN_MODE_0, false);
	GPIODirModeSet(GPIOA1_BASE, 0x8, GPIO_DIR_MODE_OUT);


    //
    // Configure PIN_58 for GPIO Input (STA/AP mode)
//    //
    MAP_PinTypeGPIO(PIN_58, PIN_MODE_0, false);
    MAP_GPIODirModeSet(GPIOA0_BASE, 0x8, GPIO_DIR_MODE_IN);


    //
    // Configure PIN_64 for Connection indication (GPIO9)
    //
    MAP_PinTypeGPIO(PIN_64, PIN_MODE_0, false);
    MAP_GPIODirModeSet(GPIOA1_BASE, 0x2, GPIO_DIR_MODE_OUT);

	//
    // Configure PIN_15 for GPIO22 Output (LED on TRF)
    //
	PinTypeGPIO(PIN_15, PIN_MODE_0, false);
	GPIODirModeSet(GPIOA2_BASE, 0x40, GPIO_DIR_MODE_OUT);

	//
    // Configure PIN_21 for GPIO25 Output (LED on TRF)
    //
	PinTypeGPIO(PIN_21, PIN_MODE_0, false);
	GPIODirModeSet(GPIOA3_BASE, 0x2, GPIO_DIR_MODE_OUT);

	// Test
	    // Configure PIN_04 for GPIO Input
	    //

		// GPIO13
		PinTypeGPIO(PIN_04, PIN_MODE_0, false);
		GPIODirModeSet(GPIOA1_BASE, 0x20, GPIO_DIR_MODE_IN);

		// GPIO22
		PinTypeGPIO(PIN_15, PIN_MODE_0, false);
		GPIODirModeSet(GPIOA2_BASE, 0x40, GPIO_DIR_MODE_IN);
*/


    // LCD E
    // Configure PIN_50 for GPIO Output
    //
    PinTypeGPIO(PIN_50, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA0_BASE, 0x1, GPIO_DIR_MODE_OUT);

    // LCD RS
    // Configure PIN_60 for GPIO Output
    //
    PinTypeGPIO(PIN_60, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA0_BASE, 0x20, GPIO_DIR_MODE_OUT);

    // LCD DB2
    // Configure PIN_61 for GPIO Output
    //
    PinTypeGPIO(PIN_61, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA0_BASE, 0x40, GPIO_DIR_MODE_OUT);

    // LCD DB5
    // Configure PIN_62 for GPIO Output
    //
    PinTypeGPIO(PIN_62, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA0_BASE, 0x80, GPIO_DIR_MODE_OUT);

    // LCD DB7
    // Configure PIN_63 for GPIO Output
    //
    PinTypeGPIO(PIN_63, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA1_BASE, 0x1, GPIO_DIR_MODE_OUT);

    // LCD DB4
    // Configure PIN_05 for GPIO Output
    //
    PinTypeGPIO(PIN_05, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA1_BASE, 0x40, GPIO_DIR_MODE_OUT);

    // LCD DB0
    // Configure PIN_08 for GPIO Output
    //
    PinTypeGPIO(PIN_08, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA2_BASE, 0x2, GPIO_DIR_MODE_OUT);

    // LCD DB3
    // Configure PIN_18 for GPIO Output
    //
    PinTypeGPIO(PIN_18, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA3_BASE, 0x10, GPIO_DIR_MODE_OUT);

    // LCD DB6
    // Configure PIN_53 for GPIO Output
    //
    PinTypeGPIO(PIN_53, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA3_BASE, 0x40, GPIO_DIR_MODE_OUT);

    // LCD DB1
    // Configure PIN_45 for GPIO Output
    //
    PinTypeGPIO(PIN_45, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA3_BASE, 0x80, GPIO_DIR_MODE_OUT);

    //-------------------------

    // MSP430 UART int
    // Configure PIN_07 for GPIO Input
    //
    PinTypeGPIO(PIN_07, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA2_BASE, 0x1, GPIO_DIR_MODE_IN);

    //-------------------------

	// SW2
	// Configure PIN_15 for GPIO Input
	//
	PinTypeGPIO(PIN_15, PIN_MODE_0, false);
	GPIODirModeSet(GPIOA2_BASE, 0x40, GPIO_DIR_MODE_IN);

	// SW3
	// Configure PIN_04 for GPIO Input
	//
	PinTypeGPIO(PIN_04, PIN_MODE_0, false);
	GPIODirModeSet(GPIOA1_BASE, 0x20, GPIO_DIR_MODE_IN);

    //-------------------------

    // RED LED
    // Configure PIN_64 for Output
    //
	PinTypeGPIO(PIN_64, PIN_MODE_0, false);
	GPIODirModeSet(GPIOA1_BASE, 0x2, GPIO_DIR_MODE_OUT);

    // GREEN LED
    // Configure PIN_01 for Output
    //
    PinTypeGPIO(PIN_01, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT);

    //-------------------------

    // Sensor
    // Configure PIN_58 for GPIO Input
    //
    PinTypeGPIO(PIN_58, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA0_BASE, 0x8, GPIO_DIR_MODE_IN);

    // Sensor
    // Configure PIN_59 for GPIO Input
    //
    PinTypeGPIO(PIN_59, PIN_MODE_0, false);
    GPIODirModeSet(GPIOA0_BASE, 0x10, GPIO_DIR_MODE_IN);

}
